doc/ballerina-soap-to-rest.postman_collection.json

{
	"info": {
		"_postman_id": "83b6fb14-4ced-4251-a196-e010b25ad301",
		"name": "ballerina-soap-to-rest",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json"
	},
	"item": [
		{
			"name": "http://localhost:9090/cep/94480100",
			"request": {
				"method": "GET",
				"header": [],
				"url": {
					"raw": "http://localhost:9090/cep/94480100",
					"protocol": "http",
					"host": [
						"localhost"
					],
					"port": "9090",
					"path": [
						"cep",
						"94480100"
					]
				}
			},
			"response": []
		},
		{
			"name": "https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente?wsdl",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"name": "Content-Type",
						"value": "application/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" \r\n                  xmlns:cli=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">\r\n    <soapenv:Header/>\r\n      <soapenv:Body>\r\n         <cli:consultaCEP>\r\n              <cep>94480100</cep>\r\n        </cli:consultaCEP>\r\n      </soapenv:Body>\r\n</soapenv:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente?wsdl",
					"protocol": "https",
					"host": [
						"apps",
						"correios",
						"com",
						"br"
					],
					"path": [
						"SigepMasterJPA",
						"AtendeClienteService",
						"AtendeCliente"
					],
					"query": [
						{
							"key": "wsdl",
							"value": null
						}
					]
				}
			},
			"response": []
		}
	],
	"protocolProfileBehavior": {}
}